fn main() {
    //Array - харнятся в стэке, размер известен во время компиляции, все данные одного типа
    let x: [u8; 3] = [1, 3, 5]; //[1, 3, 5]
    let _y: [u8; 3] = [10; 3];   //[10, 10, 10]
    // x[1] = 100;
    assert_eq!([3, 5], &x[1..]);
    for i in &x {
        println!("{:?}", i);
    }
    for (i, d) in x.iter().enumerate() {
        println!("x[{}] = {}", i, d);
    }
    //Slices - не имеют ownership
    let x1: [u8; 4] = [1, 3, 5, 7];
    println!("{:?}", &x1[0..2]); // Slice - пишется через амперсанд
    println!("{:?}", &x1[..2]); 
    println!("{:?}", &x1[2..4]); 
    println!("{:?}", &x1[2..]); 
    println!("{:?}", &x1[..]); 
}
